In [1]:
import pandas as pd
import numpy as np

In [ ]:
#1차원 list 를 dataframe으로 변환
list = [1,2,3,4,5]
df1 = pd.DataFrame(list)
print(type(df1))
print(df1)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
df1["1열"] = list
df1

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [7]:
df1.columns

Index([0, '1열'], dtype='object')

In [8]:
df2 = df1.rename(columns={0:'0열'})
df2

   0열  1열
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [12]:
#2차원 배열을 데이터프레임으로 만들기
score = [
    ['정약용', 70, 80, 100],
    ['이순신', 90, 80, 60],
    ['이율곡', 50, 100, 100]
    ]

print(type(score))
score

<class 'list'>

[['정약용', 70, 80, 100], ['이순신', 90, 80, 60], ['이율곡', 50, 100, 100]]

In [14]:
df3 = pd.DataFrame(score)
print(type(df3))
df3

<class 'pandas.core.frame.DataFrame'>

     0   1    2    3
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100

In [ ]:
df3.columns = ["이름", "국어", "영어", "수학"]
print(df3)
print(df3.shape)
print(df3.index)

    이름  국어   영어   수학
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100
(3, 4)
RangeIndex(start=0, stop=3, step=1)

In [20]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [22]:
df3.describe()

         국어          영어          수학
count   3.0    3.000000    3.000000
mean   70.0   86.666667   86.666667
std    20.0   11.547005   23.094011
min    50.0   80.000000   60.000000
25%    60.0   80.000000   80.000000
50%    70.0   80.000000  100.000000
75%    80.0   90.000000  100.000000
max    90.0  100.000000  100.000000

In [ ]:
# dictionary 데이터 프레이임으로 전환
# dic1 = {
#     'col1':[1,2,3,4],
#     'col2':[5,6,7,8]
# }
# n= pd.DataFrame(dic1)

n = pd.DataFrame({
    'col1':['1','2','3','4'],
    'col2':[5,6,7,8]
})
print(n)

  col1  col2
0    1     5
1    2     6
2    3     7
3    4     8

In [ ]:
n.info()
n.dtypes
# 숫자 column만 통계자료 생성됨
n.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [35]:
#데이터 type변경 (String -> int), (int -> float)
n_df = n.astype({'col1':int, 'col2':float})
n_df.dtypes
#컬럼을 숫자type으로 변경시 통계자료 생성됨
n_df.describe()

           col1      col2
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000

In [44]:
#전체컬럼조회
display(n_df)
#컬럼값1개는 대괄호가 1개 필요
display(n_df['col1'])
#컬럼값2개 이상에는 대괄호가 2개 필요
display(n_df[['col1','col2']])

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

In [47]:
# 순회해서 데이터 접근하기 : iteration rows : row 순회함수
for index, row in n_df.iterrows():
    print(row['col1'])

1.0
2.0
3.0
4.0

In [51]:
# 새로운 컬럼을 추가해서 sum값 만들기
n_df
n_df['sum'] = n_df['col1'] + n_df['col2']
n_df

   col1  col2   sum
0     1   5.0   6.0
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [54]:
# 8이상인sum값 구하기
n1_df = n_df[n_df['sum']>= 8]

In [ ]:
# index가 빠진상태로  들어간다
n1_df

   col1  col2   sum
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [66]:
# index 초기화 : 원래 인덱스는 남고, 새로운 초기화된 index 생성됨
n1_df.reset_index()
n1_sum = n1_df['sum']
print(type(n1_sum))
print(n1_sum.shape)
print(n1_sum)

<class 'pandas.core.series.Series'>
(3,)
1     8.0
2    10.0
3    12.0
Name: sum, dtype: float64

In [ ]:
# index를 초기화하는 다른방법 : drop=True : 예전 index는 사라지고 새로운 인덱스 생김
n2_df = n_df[n_df['sum']>= 8].reset_index(drop=True)

In [59]:
n2_df

   col1  col2   sum
0     2   6.0   8.0
1     3   7.0  10.0
2     4   8.0  12.0

In [77]:
# titanic 통계자료 분석
import pandas as pd

titanic_df = pd.read_csv('data/titanic.csv')
# titanic_df
# print(titanic_df)
print(len(titanic_df))
titanic_df.info()

891
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [78]:
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [79]:
titanic_df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [81]:
titanic_df.sort_values(by='age', ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [87]:
titanic_df['survived'].value_counts()
titanic_df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [2]:
# pandas 01/02
# dictionary를 dataFrame으로 변환
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'test': [45, 30, 40, 37, 48],
    'assign1': [20, 17, 22, 18, 24],
    'assign2': [19, 14, 18, 15, 25]
})

In [7]:
df

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [ ]:

#df.info()
#df.describe()
# arr[0,]
# name column만 빼서
df1 = df['name']
print(df1)
print(df1.shape)
# 1차원배열입
print(type(df1))
print(type(df))
print(df.shape)

0    Jessica
1       Liam
2     Sophia
3       Ryan
4       Alex
Name: name, dtype: object
(5,)
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
(5, 4)

In [ ]:

print(df1.to_frame())
#series => dataFrame 으로 변경하는 방법1
print(type(df1.to_frame()))

df2 = df1.to_frame()

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex
<class 'pandas.core.frame.DataFrame'>

In [28]:
print(df2)
print(df2.shape)

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex
(5, 1)

In [ ]:
# 컬럼두개 slice 하는 방법
df5= df[['name', 'test']]
print(df5)
print(df5.shape)

      name  test
0  Jessica    45
1     Liam    30
2   Sophia    40
3     Ryan    37
4     Alex    48
(5, 2)

In [ ]:
# series를 dataFrame으로 변경하는 방법 2
df8 = df[['name']]
print(df8)
print(df8.shape)

      name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex
(5, 1)

In [48]:
df8.columns = ['Name']
print(df8)

      Name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex

In [50]:
df9 = df8.rename(columns={'Name':'S_Name'})
df9

    S_Name
0  Jessica
1     Liam
2   Sophia
3     Ryan
4     Alex

In [52]:
print(df)

      name  test  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25

In [64]:
df.rename(columns={'test':'exam'}, inplace=True)

In [66]:
df['sum'] = df['exam'] + df['assign1'] + df['assign2']

In [67]:
print(df)

      name  exam  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97

In [68]:
df1 = df[['name','sum']]
print(df1)

      name  sum
0  Jessica   84
1     Liam   61
2   Sophia   80
3     Ryan   70
4     Alex   97

In [77]:
# 80점이상의 학생이름과 sum값을 출력
df2 = df[df['sum']>= 80][['name','sum']]
print(df2)

      name  sum
0  Jessica   84
2   Sophia   80
4     Alex   97

In [78]:
df2.reset_index()

   index     name  sum
0      0  Jessica   84
1      2   Sophia   80
2      4     Alex   97

In [79]:
df3 = df2.reset_index(drop=True)
df3

      name  sum
0  Jessica   84
1   Sophia   80
2     Alex   97

In [82]:
df4 = df3.sort_values(by='sum', ascending=False).reset_index(drop=True)
df4

      name  sum
0     Alex   97
1  Jessica   84
2   Sophia   80

In [83]:
df

      name  exam  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97

In [85]:
df['grade'] = np.where(df['sum']>=90, 'A',
                       np.where(df['sum'] >= 80, 'B', 'C')
                       )
print(df)

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [87]:
df['result'] = np.where(df['sum'] >= 80, 'Pass', 'Fail')
df

      name  exam  assign1  assign2  sum grade result
0  Jessica    45       20       19   84     B   Pass
1     Liam    30       17       14   61     C   Fail
2   Sophia    40       22       18   80     B   Pass
3     Ryan    37       18       15   70     C   Fail
4     Alex    48       24       25   97     A   Pass

In [94]:
df_count = df['result'].value_counts()
print(df_count)
print(df_count.shape)
print(type(df_count))
df_c = df_count.to_frame()

result
Pass    3
Fail    2
Name: count, dtype: int64
(2,)
<class 'pandas.core.series.Series'>

In [99]:
print(df_c)
print(df_c.shape)

        count
result
Pass        3
Fail        2
(2, 1)

In [100]:
df_c.reset_index(drop= True)

   count
0      3
1      2

In [101]:
df['grade'].value_counts()

grade
B    2
C    2
A    1
Name: count, dtype: int64

In [ ]:
### inplace 사용 : column명변경/삭제, row 삭제/sort(x)
# 원데이터를 그냥두지만, inplace= True 시에는 원데이터 삭제함

In [104]:
df.drop(columns="result", inplace = True)

In [105]:
df

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [106]:
df.drop(index=2)

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [107]:
df

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [110]:
df.drop(index=[1,2])

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [111]:
df

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [ ]:
#df.drop(index=0)
#df.drop(index=[1,2])
#80미만인경우 삭제
#df.drop(df[df['sum']<80].index, inplace=False )
print(df[df['sum']<80].index)

Index([1, 3], dtype='int64')

In [113]:
df

      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A

In [134]:
df[['exam','sum']]

   exam  sum
0    45   84
1    30   61
2    40   80
3    37   70
4    48   97

In [ ]:
#2차원배열의 특정값(row,column)
print(df.loc[0,"exam"])
print(df.loc[1,"sum"])
print(df.loc[:,"exam"])
print(df.loc[:,"exam"].shape)

45
61
0    45
1    30
2    40
3    37
4    48
Name: exam, dtype: int64
(5,)

In [154]:
# index를 새로 구해서 나옴
print(df.iloc[:,0:4])
print(df.iloc[:,-1])
print(df.iloc[:,:])
print(df.iloc[:,:-1])

      name  exam  assign1  assign2
0  Jessica    45       20       19
1     Liam    30       17       14
2   Sophia    40       22       18
3     Ryan    37       18       15
4     Alex    48       24       25
0    B
1    C
2    B
3    C
4    A
Name: grade, dtype: object
      name  exam  assign1  assign2  sum grade
0  Jessica    45       20       19   84     B
1     Liam    30       17       14   61     C
2   Sophia    40       22       18   80     B
3     Ryan    37       18       15   70     C
4     Alex    48       24       25   97     A
      name  exam  assign1  assign2  sum
0  Jessica    45       20       19   84
1     Liam    30       17       14   61
2   Sophia    40       22       18   80
3     Ryan    37       18       15   70
4     Alex    48       24       25   97

In [155]:
# Pandas : np.nan = null값 : not a number : NaN
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [157]:
print(df)
df.info()

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  3 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [159]:
df.describe()
df['gender'].value_counts()

gender
F    2
M    1
Name: count, dtype: int64

In [161]:
pd.isna(df).sum()

name      0
gender    2
score     1
dtype: int64

In [166]:
# NaN data 삭제
clean_df = df.dropna()
print(df)
print("=========================")
print(clean_df)

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0
=========================
      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0

In [ ]:
# name, score 없는 데이터 삭제 cf)inplace =True로 삭제 가능
c_df = df.dropna(subset=['name', 'score'])
c_df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [177]:
# NaN값을 채워줌
print(df)
df1 = df.fillna(0)
print(df1)
df2 = df.fillna({'gender':'etc', 'score':0})
print(df2)
df3 = df.fillna({'gender':'etc', 'score':df['score'].mean()})
print(df3)
df3.value_counts('gender')

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0
      name gender  score
0  Jessica      F   89.0
1     Liam      0   75.0
2   Sophia      0   95.0
3     Ryan      M    0.0
4     Alex      F   93.0
      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M    0.0
4     Alex      F   93.0
      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M   88.0
4     Alex      F   93.0

gender
F      2
etc    2
M      1
Name: count, dtype: int64

In [2]:
import pandas as pd
import numpy as np

# Pandas : np.nan = null값 : not a number : NaN
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [6]:
pd.isna(df).sum()
#pd.isnull(df)

name      0
gender    2
score     1
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  3 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [13]:
df.head()
#df.tail()

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [12]:
#숫자데이터만 통계
#df.describe()
df['score'].describe()

count     4.0000
mean     88.0000
std       9.0185
min      75.0000
25%      85.5000
50%      91.0000
75%      93.5000
max      95.0000
Name: score, dtype: float64

In [17]:
#결손데이터를 날리는 경우
clean_df= df.dropna()
clean_df

      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0

In [20]:
clean_df = df.dropna(subset=['name','score'])
clean_df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [29]:
#inplace=True 원본데이터 삭제

df.dropna(subset=['name', 'score'], inplace = True)

df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [ ]:
#reset_inedx(drop=True) 원본데이터의 row index를 clear
df.reset_index(drop=True, inplace=True)
#df.drop(columns=['Index'], inplace=True)

In [32]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Alex      F   93.0

In [33]:
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [34]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [35]:
df.dropna(subset=['name','score'], inplace=True)

In [36]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [37]:
df.reset_index(inplace=True)

In [38]:
df

   index     name gender  score
0      0  Jessica      F   89.0
1      1     Liam    NaN   75.0
2      2   Sophia    NaN   95.0
3      4     Alex      F   93.0

In [39]:
df.drop(columns=['index'] )

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Alex      F   93.0

In [40]:
df

   index     name gender  score
0      0  Jessica      F   89.0
1      1     Liam    NaN   75.0
2      2   Sophia    NaN   95.0
3      4     Alex      F   93.0

In [41]:
df.drop(columns=['index'], inplace=True)
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Alex      F   93.0

In [42]:
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [47]:
#결축치 대체
df1= df.fillna(0)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  5 non-null      object
 2   score   5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [48]:
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [ ]:
# 결측치 0
df1 = df.fillna({'gender':'etc', 'score':0})
df1

      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M    0.0
4     Alex      F   93.0

In [ ]:
#결측치 평균값
df1 = df.fillna({
    'gender':'etc',
    'score': df['score'].mean()
})
df1

      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M   88.0
4     Alex      F   93.0

In [51]:
df1 = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', 'M', 'F', 'M', 'F'],
    'age': [21, 23, 20, 22, 20]
})

df2 = pd.DataFrame({
    'name': ['Sophia', 'Liam', 'Ryan', 'Alex', 'Jessica'],
    'department': ['computer science', 'mathematics', 'law',
                   'computer science', 'law']
})

df4 = pd.DataFrame({
    'department': ['computer science', 'mathematics', 'law'],
    'head of department': ['Steve', 'Emma', 'Carly']
})

In [52]:
df1

      name gender  age
0  Jessica      F   21
1     Liam      M   23
2   Sophia      F   20
3     Ryan      M   22
4     Alex      F   20

In [53]:
df2

      name        department
0   Sophia  computer science
1     Liam       mathematics
2     Ryan               law
3     Alex  computer science
4  Jessica               law

In [ ]:
# name 데이터를 이용하여 df1, df2를 합침 merge on
df3 = pd.merge(df1,df2, on='name')

In [59]:
df3

      name gender  age        department
0  Jessica      F   21               law
1     Liam      M   23       mathematics
2   Sophia      F   20  computer science
3     Ryan      M   22               law
4     Alex      F   20  computer science

In [60]:
df4

         department head of department
0  computer science              Steve
1       mathematics               Emma
2               law              Carly

In [62]:
#df5에 department로 df3, df4 merge
df5 = pd.merge(df3, df4, on='department')
df5

      name gender  age        department head of department
0  Jessica      F   21               law              Carly
1     Liam      M   23       mathematics               Emma
2   Sophia      F   20  computer science              Steve
3     Ryan      M   22               law              Carly
4     Alex      F   20  computer science              Steve

In [66]:
df5.sort_values('age', ascending=False)

      name gender  age        department head of department
1     Liam      M   23       mathematics               Emma
3     Ryan      M   22               law              Carly
0  Jessica      F   21               law              Carly
2   Sophia      F   20  computer science              Steve
4     Alex      F   20  computer science              Steve

In [67]:
df5['gender'].value_counts()

gender
F    3
M    2
Name: count, dtype: int64

In [68]:
df5['head of department'].value_counts()

head of department
Carly    2
Steve    2
Emma     1
Name: count, dtype: int64

In [69]:
df5.count()

name                  5
gender                5
age                   5
department            5
head of department    5
dtype: int64

In [70]:
df5.describe()

            age
count   5.00000
mean   21.20000
std     1.30384
min    20.00000
25%    20.00000
50%    21.00000
75%    22.00000
max    23.00000

In [71]:
df10 = pd.DataFrame({
    'test': [45, 30, 40, 37, 48],
    'assign1': [20, 17, 22, 18, 24],
    'assign2': [19, 14, 18, 15, 25]
})

In [72]:
df10.describe()

            test    assign1   assign2
count   5.000000   5.000000   5.00000
mean   40.000000  20.200000  18.20000
std     7.035624   2.863564   4.32435
min    30.000000  17.000000  14.00000
25%    37.000000  18.000000  15.00000
50%    40.000000  20.000000  18.00000
75%    45.000000  22.000000  19.00000
max    48.000000  24.000000  25.00000